Autodesk.Revit.DB.Structure.RebarBendData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarBendData.HookBendRadius
The radius of the hook fillets in the Rebar shape.
Remarks:
Inner radius, not centerline
Since:
2012

Autodesk.Revit.DB.Structure.RebarBendData.HookOrient1
The orientation of the hook at the end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Structure.RebarBendData.HookOrient0
The orientation of the hook at the start.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Structure.RebarBendData.HookAngle1
The angle of the hook at the end.
Since:
2012

Autodesk.Revit.DB.Structure.RebarBendData.HookAngle0
The angle of the hook at the start.
Since:
2012

Autodesk.Revit.DB.Structure.RebarBendData.HookLength1
The extension length of the hook at the end.
Since:
2012

Autodesk.Revit.DB.Structure.RebarBendData.HookLength0
The extension length of the hook at the start.
Since:
2012

Autodesk.Revit.DB.Structure.RebarBendData.BarDiameter
The diameter of the bar.
Since:
2012

Autodesk.Revit.DB.Structure.RebarBendData.BendRadius
The radius of all fillets, except hook fillets, in the Rebar shape.
Remarks:
Inner radius, not centerline
Since:
2012

Autodesk.Revit.DB.Structure.RebarBendData.#ctor(Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarStyle,Autodesk.Revit.DB.Structure.RebarHookOrientation,Autodesk.Revit.DB.Structure.RebarHookOrientation)
Constructs a new RebarBendData using the bar type, hook types, style and orientation values.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.Structure.RebarBendData.#ctor
Constructs a new RebarBendData with default settings.
Since:
2012

Autodesk.Revit.DB.Structure.RebarBendData
The values in this class provide a summary of information taken from the RebarBarType, RebarHookType, and RebarStyle.
Remarks:
The purpose of collecting the values in this class is to allow you to
create and analyze an accurate representation of a RebarShape, without creating a Rebar
instance, and without referring to RebarBarType, RebarHookType, and RebarStyle.
If you do have a Rebar instance, its GetBendData() method will produce a RebarBendData
object.
Since:
2012